$regfile = "attiny44.dat"                                   'вказуємо наш мікроконтролер
$crystal = 1000000                                          'встановлюємо тактову честоту

Config 1wire = Porta.1                                      'конфігуруємо ніжку на роботу за протоколом 1-wire
Config Porta.0 = Output                                     'конфігуруємо ніжку як вхід
Config Pinb.2 = Input                                       'конфігуруємо ніжку як вихід
Config Int0 = Rising                                        'конфігуруємо спрацювання переривання INT0 по передньому фронту

Dim S As String * 4
Dim A As Byte
Dim B As Byte
Dim C As Byte
Dim D As String * 1

Open "comb.0:9600,8,n,1" For Input As #1                    'кофігуруємо ніжки, до яких під'єднані
Open "comb.1:9600,8,n,1" For Output As #2                   'контакти послідовного порта

1wreset                                                     'виконуємо скидання лінії 1-wire

Enable Interrupts                                           'вмикаємо переривання
Enable Int0                                                 'вмикаємо переривання INT0
On Int0 Rts                                                 'додаємо обробник переривання

Do
1wwrite &HCC                                                'вказуємо, що наступна команда адресована всім пристроям на лінії 1-wire
1wwrite &H44                                                'команда конвертації температури в бінарний вигляд
Waitms 750                                                  'чекаємо 750 мс
1wreset                                                     'виконуємо скидання лінії 1-wire
1wwrite &HCC                                                'вказуємо, що наступна команда адресована всім пристроям на лінії 1-wire
1wwrite &HBE                                                'команда читання пам'яті датчика
A = 1wread()                                                'зчитуємо два байти з лінії 1-wire у змінні A та B
B = 1wread()
S = Hex(b)                                                  'перетворюємо байти A та B у строку в шістнадцятковому вигляді
S = S + Hex(a)
1wreset                                                     'виконуємо скидання лінії 1-wire
Loop

Rts:                                                        'обробник переривання INT0
Porta.0 = 1                                                 'встановлюємо сигнал CTS для хоста
Input #1 , D                                                'зчитуємо строку з послідовного порта у змінну A
Porta.0 = 0                                                 'прибираємо сигнал CTS для хоста
C = Hexval(d)                                               'перетворюємо шіснадцяткове значення змінної D у байт C
If C = 0 Then                                               'якщо отримали 0 то
Print #2 , S                                                'надсилаємо на послідовний порт змінну S
End If
Return                                                      'певертаємось до основного циклу

End
